<?php

namespace Database\Seeders;

use App\Models\Article;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ArticleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //

        Article::query()->create([
            'link'=>'https://www.psychologytoday.com/us/blog/cant-stress-this-enough/202403/taming-the-amygdala-in-ptsd',
            'title' => 'کشف اسرار PTSD: استفاده از قدرت مغز برای شفا',
            'body' => '<div>
   <p>مقدمه:
       احساس ترس در مواجهه با خطر، یک واکنش غریزی و طبیعی است. در مغز ما، یک ساختار کوچک اما بسیار قوی به نام آمیگدال، نقش اصلی در پردازش این احساس را دارد. این مقاله به بررسی نقش آمیگدال در پردازش ترس، اختلال استرس پس از سانحه (PTSD) و راهکارهایی که علم درمانی ارائه می‌دهد برای کمک به افراد مبتلا به این اختلال، می‌پردازد.</p>

   <h2>درک نقش آمیگدال</h2>
   <p>آمیگدال در اعماق لوب تمپورال مغز قرار دارد و به عنوان مرکز فرماندهی پاسخ های ترس عمل می کند. علاوه بر ایجاد واکنش های فوری، نقش مهمی در شکل گیری خاطرات ترسناک دارد. این خاطرات به‌عنوان ابزار ارزشمندی برای بقا عمل می‌کنند و به ما کمک می‌کنند تا خطرات مشابهی را در آینده بشناسیم و نسبت به آنها واکنش نشان دهیم.</p>

   <h2>درک ریتم های مغزی و PTSD</h2>
   <p>در حالی که الگوهای خاصی از فعالیت مغز که به عنوان ریتم تتا شناخته می‌شوند، ارتباط نزدیکی با خاطرات ترس دارند، در افرادی که با PTSD مبتلا هستند ممکن است این الگوها متفاوت باشند. تحقیقات نشان می‌دهد که رویکردهای درمانی نوآورانه‌ای می‌توانند در کاهش علائم PTSD مؤثر باشند.</p>

   <h2>رویکردهای درمانی نوآورانه</h2>
   <p>با توجه به نتایج تحقیقات، رویکردهای درمانی نوآورانه‌ای مانند تحریک حلقه بسته، می‌توانند در کاهش علائم PTSD مؤثر باشند. این روش‌ها، همچنین منجر به کاهش فعالیت آمیگدال تتا در هنگام قرار گرفتن در معرض محرک‌های بد می‌شوند، که نشان‌دهنده ارتباط مستقیم بین فعالیت عصبی و تسکین علائم است.</p>

   <h2>با نگاه به آینده</h2>
   <p>هرچند رویکردهای درمانی نوآورانه امیدوارکننده هستند، اما نیاز به بررسی مداخلات جایگزین و کاهش محدودیت‌های روش‌های فعلی ضروری است. تحقیقات بیشتر در زمینه PTSD و درمان آن ضروری است تا بتوانیم به بهبود درمان این اختلال روانی کمک کنیم.</p>
</div>',
            'references' => '<ul class="reference">
   <li>Gill, J.L., Schneiders, J.A., Stangl, M. et al.
       <em>یک مطالعه پایلوت از نورومودولاسیون حلقه بسته برای اختلال استرس پس از ضایعه تروماتیک مقاوم به درمان</em>
       <a href="https://doi.org/10.1038/s41467-023-38712-1">Nat Commun 14, 2997 (2023)</a>
   </li>
   <li>Zhao, Z., Duek, O., Seidemann, R. et al.
       <em>آموزش کاهش فعالیت هیپوکامپ با استفاده از نوروفیدبک ام‌اف‌آری در اختلال استرس پس از ضایعه تروماتیک: یک آزمایش تصادفی، دو سویه</em>
       <a href="https://doi.org/10.1038/s41398-023-02467-6">Transl Psychiatry 13, 177 (2023)</a>
   </li>
</ul>
',
            'image_url' => '/uploads/articles/article1.jpg',
        ]);

        Article::query()->create([
            'link'=>'https://www.psychologytoday.com/us/blog/dating-and-mating/202403/the-surprisingly-strong-link-between-genetics-and-infidelity',
            'title' => 'بررسی ارتباط  بین ژنتیک و خیانت',
            'body' => '<div>
   <p>مقدمه:
       آیا ژنتیک می‌تواند در رفتارهای خیانتکارانه تأثیرگذار باشد؟ آیا ارتباطی بین ترکیب ژنتیکی و احتمال خیانت به شریک زندگی وجود دارد؟ این سوالات بسیاری از ما را مشغول به فکر می‌کنند. در این مقاله، ما به بررسی این ارتباط می‌پردازیم.</p>

   <h2>مطالعات بر روی دوقلوها</h2>
   <p>برای درک بهتر این ارتباط، دانشمندان اغلب به مطالعه دوقلوها روی می‌آورند. دوقلوهای تک‌تخمکی که ۱۰۰٪ از ژن‌های خود را به اشتراک می‌گذارند، و دوقلوهای دوتخمکی که حدود ۵۰٪ از ژن‌های خود را به اشتراک دارند. تحقیقات نشان می‌دهند که احتمال خیانت بیشتر در دوقلوهای تک‌تخمکی است که نشان‌دهنده نقش ژنتیک در خیانت است.</p>

   <h2>نتایج مطالعات</h2>
   <p>یک مطالعه در سال ۲۰۰۴ نشان داد که بین دوقلوهای تک‌تخمکی و دوتخمکی، نسبت به خیانت تفاوتی وجود ندارد، اما تأثیر ژنتیکی در این خصوص قابل ملاحظه است. مطالعات بیشتر نیز نشان می‌دهند که ژنتیک ممکن است در تعیین تعداد شرکای جنسی نقش داشته باشد.</p>

   <h2>تأثیرات ژنتیکی و محیطی</h2>
   <p>با وجود این تأثیرات ژنتیکی، باید توجه داشت که رفتارهای ما تنها به ژنتیک برنمی‌گردد. فرایندهای محیطی نیز می‌توانند در شکل‌گیری رفتار خیانتکارانه مؤثر باشند. بنابراین، این ارتباط نباید به عنوان دلیلی برای توجیه خیانت تعبیر شود.</p>
</div>',
            'references' => '<ul class="reference">
   <li>Cherkas, L. F., Oelsner, E. C., Mak, Y. T., Valdes, A., & Spector, T. D.
       <em>تأثیرات ژنتیکی بر بی وفایی زنان و تعداد شریک‌های جنسی در انسان‌ها: یک مطالعه ارتباطی و انجمنی از نقش ژن گیرنده وازوپرسین (AVPR1A)</em>
       <a href="https://doi.org/10.1375/1369052042663922">Twin Research : The Official Journal of the International Society for Twin Studies, 7(6), 649–658</a>
   </li>
   <li>Garcia, J. R., MacKillop, J., Aller, E. L., Merriwether, A. M., Wilson, D. S., & Lum, J. K.
       <em>ارتباط بین واریانس ژن گیرنده دوپامین D4 با هر دو بی وفایی و پرخاشگری جنسی</em>
       <a href="https://doi.org/10.1371/journal.pone.0014162">PloS One, 5(11), e14162</a>
   </li>
   <li>Zietsch, B. P., Westberg, L., Santtila, P., & Jern, P.
       <em>تجزیه و تحلیل ژنتیکی از رفتار جنسی بیگانه انسان: ارث‌پذیری، همبستگی بین جنسی، و ژن‌های گیرنده برای وازوپرسین و اکسیتوسین</em>
       <a href="https://doi.org/10.1016/j.evolhumbehav.2014.10.001">Evolution and Human Behavior, 36(2), 130-136</a>
   </li>
</ul>
',
            'image_url' => '/uploads/articles/article2.jpg',
        ]);

        Article::query()->create([
            'link'=>'https://www.psychologytoday.com/us/blog/the-psychology-of-relationships/202403/looking-for-a-career-advantage-work-on-your',
            'title' => 'به دنبال یک مزیت شغلی هستید؟ روی رابطه خود کار کنید',
            'body' => '<div>
   <p>برای دستیابی به موفقیت شغلی، ما اغلب بر تقویت مهارت‌های خود، تعقیب ترفیعات و گسترش شبکه حرفه‌ای خود تمرکز می‌کنیم. با این حال، یک جنبه دست کم گرفته شده وجود دارد که به طور قابل توجهی بر سفر حرفه‌ای ما تأثیر می‌گذارد: روابط عاشقانه ما.</p>

   <h2>نقش حیاتی روابط</h2>
   <p>تحقیقات نشان می‌دهد که تقویت پیوندهای قوی با شرکای ما برای شادی و رضایت کلی بسیار مهم است. افراد با رضایت زناشویی پایین‌تر احتمال بیشتری دارند که اثرات منفی زندگی خانوادگی را بر عملکرد کاری خود درک کنند.</p>

   <h2>تغییر در دیدگاه</h2>
   <p>تقویت روابط ما می‌تواند تأثیری موج دار داشته باشد و بر جنبه‌های مختلف زندگی ما از جمله شغل ما تأثیر مثبت بگذارد. این موضوع نشان از این دارد که موفقیت شغلی بیشتر می‌تواند به دستاوردهای روابط عاشقانه مرتبط باشد.</p>

   <h2>شواهد از مطالعات</h2>
   <p>مطالعات نشان می‌دهند که افراد در ازدواج‌های با کیفیت بالا در طول دوره‌های کاری چالش برانگیز تأثیر منفی کمتری بر سلامت روان خود دارند. همچنین، رضایت بیشتر از رابطه با سطوح پایین تر فرسودگی شغلی و خستگی عاطفی مرتبط است.</p>

   <h2>خوراکی‌های کلیدی</h2>
   <p>شرکت‌ها می‌توانند با تصدیق نقش روابط عاشقانه و ایجاد ابتکاراتی برای پرورش آنها از رشد حرفه‌ای کارکنان خود حمایت کنند. همچنین، مؤسسات آموزشی می‌توانند با ادغام دوره‌های متمرکز بر روابط در برنامه درسی خود، از تأثیر گسترده‌تر روابط قوی بر جنبه‌های مختلف زندگی استفاده کنند.</p>

   <p>در اصل، ایجاد یک رابطه رضایت بخش فقط برای رفاه شخصی مفید نیست. همچنین یک سرمایه‌گذاری استراتژیک برای موفقیت شغلی است. با اولویت دادن به مهارت‌های ایجاد رابطه، افراد می‌توانند بسیاری از مزایایی را که بسیار فراتر از محدودیت‌های زندگی شخصی آن‌ها است، باز کنند.</p>
</div>',
            'references' => '<ul class="reference">
   <li>Barnett, R. C. (1994).
       <em>موثرات جاری از خانه به محل کار: یک مطالعه بر روی زنان کارمند تمام وقت در زندگی زناشویی دو درآمدی</em>
       <a href="https://doi.org/10.2307/352875">Journal of Marriage and the Family, 56(3), 647–656</a>
   </li>
   <li>Dionisi, A. M., & Barling, J. (2019).
       <em>چه اتفاقی در خانه رخ می‌دهد، در خانه نمی‌ماند: نقش خانواده و تعارض همسرانه در رهبری مخرب</em>
       <a href="https://doi.org/10.1002/smi.2858">Stress and Health, 35(3), 304–317</a>
   </li>
   <li>Gharibi, K.P., Panteha, F., & Gabriel, N. (2020, June).
       <em>ارزیابی تأثیر سندرم خستگی شغلی بر رضایت از رابطه عاشقانه: طرف تاریک آزار کاری</em>
       <a href="https://doi.org/10.2478/jeb-2020-0016">South East European Journal of Economics and Business, 15(1), 44-55</a>
   </li>
   <li>Kinnunen, U., Feldt, T., Geurts, S., & Pulkkinen, L. (2006).
       <em>انواع رابطه کار و خانواده: همبستگی‌های رفاه بین انتقال منفی و مثبت بین کار و خانواده</em>
       <a href="https://doi.org/10.1111/jomf.12683">Scandinavian Journal of Psychology, 47(2), 149–162</a>
   </li>
   <li>Kornblum, A., Unger, D., & Grote, G. (2021).
       <em>چگونگی تأثیر روابط عاطفی بر دستیابی به اهداف شغلی فرد: دیدگاه دینامیک اهداف تبادلی</em>
       <a href="https://doi.org/10.1016/j.jvb.2020.103523">Journal of Vocational Behavior, 125, Article 103523</a>
   </li>
   <li>McDonald, P. (2020).
       <em>پاداش ازدواج مردان: انتخاب، بهره‌وری، یا ترجیحات کارفرما؟</em>
       <a href="https://doi.org/10.1111/jomf.12683">Journal of Marriage and Family, 82(5), 1553–1570</a>
   </li>
   <li>Özdemir, B., & Demir, A. (2019).
       <em>رضایت از رابطه عاشقانه، سن، حجم درس، رضایت از درآمد و وضعیت والدین به عنوان پیش‌بین‌های خستگی اساتید: شواهدی از یک مطالعه همبستگی</em>
       <a href="https://doi.org/10.1007/s12144-017-9724-3">Current Psychology: A Journal for Diverse Perspectives on Diverse Psychological Issues, 38(5), 1083–1098</a>
   </li>
</ul>
',
            'image_url' => '/uploads/articles/article3.jpg',
        ]);

        Article::query()->create([
            'link' => 'https://www.psychologytoday.com/us/blog/darwins-subterranean-world/202403/why-do-some-things-make-us-feel-disgust',
            'title' => 'چرا بعضی چیزها باعث می شود ما احساس انزجار کنیم؟',
            'body' => '<div>
   <h1>کشف راز انزجار: سیستم ایمنی رفتاری</h1>
   <p>آیا تا به حال فکر کرده اید که چرا برخی چیزها باعث ایجاد احساس شدید انزجار می‌شوند؟ چه مشاهده استفراغ، چه بوی مدفوع، یا دیدن فردی با زخم باز، این واکنش ها چیزی بیش از تنفر طبیعی هستند – آنها بخشی از سیستم ایمنی رفتاری ما هستند، جنبه ای جذاب از تکامل انسان که اغلب از بین می رود.</p>
   <h2>سیستم ایمنی رفتاری توضیح داد</h2>
   <p>در قلب روانشناسی تکاملی مفهوم سیستم ایمنی رفتاری نهفته است، مجموعه ای از ویژگی های رفتاری و روانی که برای محافظت از ما در برابر عوامل بیماری زای مضر طراحی شده است. اساساً این روش بدن ما برای کاهش قرار گرفتن در معرض تهدیدات بالقوه است که فراتر از پاسخ‌های فیزیولوژیکی است و طیف وسیعی از رفتارها را شامل می‌شود.</p>
   <h2>نمونه هایی از سیستم ایمنی رفتاری در عمل</h2>
   <p>واکنش احشایی که هنگام مواجهه با مدفوع یا استفراغ دارید را در نظر بگیرید - این فقط یک پاسخ آموخته شده نیست، بلکه یک واکنش تطبیقی است که ریشه در تاریخچه تکاملی ما دارد. به طور مشابه، مشاهده استفراغ شخص دیگری می‌تواند باعث ایجاد مجموعه‌ای از پاسخ‌های فیزیولوژیکی از جمله حالت تهوع شود که همگی با هدف به حداقل رساندن قرار گرفتن در معرض عوامل بیماری‌زا هستند.</p>
   <h2>اهمیت انزجار</h2>
   <p>در حالی که احساس انزجار ممکن است ناخوشایند باشد، اما نقش مهمی در حفظ رفاه ما دارد. انزجار، در کنار سایر احساسات اولیه انسانی، جزء لاینفک مدل مشهور پل اکمن است و بر اهمیت آن در میراث تکاملی ما تأکید دارد.</p>
</div>',
            'references' => '<ul class="reference">
   <li>Barkow, J.,. Cosmides, L., & Tooby, J. (Eds.).
       <em>ذهن سازگار: روانشناسی تکاملی و تولید فرهنگ</em>
       New York: Oxford University Press.
   </li>
   <li>Bingham, P. M., & Souza, J. (2009).
       <em>مرگ از دور و تولد یک جهان انسانی</em>
       Lexington, KY: BookSurge Publishing.
   </li>
   <li>Buss, D. M. (2017).
       <em>تکامل خواسته: استراتژی‌های جفت‌گیری انسانی</em>
       (ویرایش بازنگری شده). New York: Basic Books.
   </li>
   <li>Curtis V, de Barra M, Aunger R.
       <em>نفرت به عنوان یک سیستم سازگار برای رفتار پرهیز از بیماری</em>
       Philos Trans R Soc Lond B Biol Sci. 2011 Feb 12;366(1563):389-401. doi: 10.1098/rstb.2010.0117. PMID: 21199843; PMCID: PMC3013466.
   </li>
   <li>Ekman, P., Sorenson, E. R., & Friesen, W. V. (1969).
       <em>عناصر پان‌فرهنگی در نمایش چهره احساسات</em>
       Science, 164, 86-88.
   </li>
   <li>Geher, G. (2014).
       <em>راهنمای روانشناسی تکاملی 101</em>
       New York: Springer.
   </li>
   <li>Gruskin, K., & Geher, G. (2018).
       <em>کلاس درس تکاملی: استفاده از نظریه تکامل برای اطلاع از پردازش‌های ابتدایی</em>
       Evolutionary Behavioral Sciences, 12, 1-13.
   </li>
   <li>Nesse RM, Williams GC.
       <em>چرا ما بیمار می‌شویم: علم جدید پزشکی داروینی</em>
       Times Books, New York, 1995.
   </li>
   <li>Pipitone, R.N. & DiMattina, C. (2020).
       <em>گروه‌های شیء یا طیف انرژی؟ ارزیابی مشارکت‌های نسبی طیف‌های فاز تصویر و طیف انرژی به تریپوفوبیا</em>
       Frontiers in Psychology: Perception Science, 11:1847. DOI: 10.3389/fpsyg.2020.01847
   </li>
   <li>Schaller, M. (2006).
       <em>طفره‌گران، دفاع‌های رفتاری، و مکانیسم‌های روانشناختی اجتماعی که منجر به ترسیم فرهنگ‌ها می‌شوند</em>
       Psychological Inquiry. 17 (2): 96–101.
   </li>
   <li>Smith, D. L. (2008).
       <em>پرخطرترین حیوان</em>
       New York: St. Martin’s Griffin.
   </li>
   <li>Tybur J. M., Lieberman D., Kurzban R., DeScioli P. (2013).
       <em>نفرت: عملکرد و ساختار تکامل یافته</em>
       Psychol. Rev. 120 65–84. 10.1037/a0030778
   </li>
   <li>Wilson, D. S. (2019).
       <em>این دیدگاه زندگی: انجام انقلاب داروینی</em>
       Pantheon: New York.
   </li>
</ul>
',
            'image_url' => '/uploads/articles/article4.jpg',
        ]);

    }
}
