<?php

return [


    'email' => 'info@elmokar.com',
    'text1' => '',
    'find_course' => 'جستجو در میان دروس',



    'slogan1' => 'آموزش با محوریت بازار کار',


    'seo' => [
        'title' => 'علم و کار ',
        'description' => 'آموزش با محوریت بازار کار',
    ],


    'heading' => [
        'MostPopularCourses' => 'آموزش‌های پرمخاطب',
        'becomeInstructor' => 'تدریس در علم و کار',
        'hero' => 'علم و کار',
        'suggestedCourses' => 'آموزش های پیشنهادی برای شما',
        'feedbacks' => 'بازخوردها',
        'VerifiedMentors' => 'آخرین اساتید تایید شده',
        'contact' => 'اطلاعات تماس'

    ],
    'description' => [
        'MostPopularCourses' => 'در این بخش آموزش هایی که بیشترین بازدید را داشته اند دسته بندی شده اند',
        'becomeInstructor' => 'برای همکاری آموزشی، تدریس و ارایه آموزش در علم و کار و پیوستن به آن به عنوان عضو هیات علمی، به لینک زیر مراجعه کنید.',
        'hero' => 'در علم و کار میتوانید محصولات آموزشی با محوریت بازار کار را خریداری نمایید',
        'suggestedCourses' => 'بر اساس سوابق کلیک شما این قسمت را تنظیم کرده ایم. این قسمت برای هر کس متفاوت دیده میشود',
        'feedbacks' => 'باعث افتخار است که همواره در طول فعالیتمان توانسته ایم بازخورد خوبی از اساتید و دانشجویان دریافت نماییم. در این قسمت این حس خوب را با شما به اشتراک خواهیم گذاشت. بازخوردها به صورت رندوم انتخاب میشوند',
        'footer' => 'علم و کار کوشش دارد تا بستری مطمئن، جهت تولید دوره های آموزشی با محوریت بازار کار را برای مخاطبان خود فراهم نماید',
        'copyright' => 'کلیه ی حقوق این وبسایت به علم و کار تعلق دارد',
        'contact' => 'نشانی اراک حافظیه نبش لاله ۲۷ پلاک ۸۷۸۱ - تلفن 09128182951'
    ],
    'button' => [
        'becomeInstructor' => 'مدرس شوید',
        'addToCart' => 'افزودن به سبد خرید',
        'feedbacks' => 'مشاهده همه',
    ],

    'words' => [
        'free' => 'رایگان',
        'minute' => 'دقیقه',
        'email' => 'ایمیل',
    ],

    'footer' => [
        'heading1' => 'برگه ها',
        'heading2' => 'دوره ها',
        'heading3' => 'پکیج ها',
        'heading4' => 'اطلاعات تماس',
    ],



];
