<?php

return [


    'becomeInstructor' => 'علم و کار بزرگترین پلتفرم آموزش آنلاین در ایران است که تاکنون بیش از ۱۹,۰۰۰ ساعت آموزش ویدئویی دانشگاهی، کاربردی و عمومی، منتشر کرده است. آموزش‌های علم و کار، به صورت ویدئویی، در زمینه‌‌ها و رشته‌های مختلف، تهیه و ضبط می‌شوند و در اختیار بیش از یک میلیون دانشجوی آنلاین در سراسر ایران و خارج از کشور قرار می‌گیرند.',
    'becomeInstructor2' => 'علم و کار بزرگترین پلتفرم آموزش آنلاین در ایران است که تاکنون بیش از ۱۹,۰۰۰ ساعت آموزش ویدئویی دانشگاهی، کاربردی و عمومی، منتشر کرده است. آموزش‌های علم و کار، به صورت ویدئویی، در زمینه‌‌ها و رشته‌های مختلف، تهیه و ضبط می‌شوند و در اختیار بیش از یک میلیون دانشجوی آنلاین در سراسر ایران و خارج از کشور قرار می‌گیرند.',
    'welcome' => 'علم و کار بزرگترین پلتفرم آموزش آنلاین در ایران است که تاکنون بیش از ۱۹,۰۰۰ ساعت آموزش ویدئویی دانشگاهی، کاربردی و عمومی، منتشر کرده است. آموزش‌های علم و کار، به صورت ویدئویی، در زمینه‌‌ها و رشته‌های مختلف، تهیه و ضبط می‌شوند و در اختیار بیش از یک میلیون دانشجوی آنلاین در سراسر ایران و خارج از کشور قرار می‌گیرند.',
    'contactUs' => 'از طریق فرم زیر درخواست خود را برای ما ارسال کنید. کارشناسان ما در اسرع وقت پاسخگوی شما خواهند بود.',
    'login' => '',
    'noAccount' => 'آیا هنوز ثبت نام نکرده اید؟ ',
    'joinUs' => 'به جمع هزاران مهارتجوی علم و کار بپیوندید',




];
